################################################################################
################################################################################
################################################################################
###############                Atividade 2                  ####################
###############     Funções + Funções de Repetição - Apply  ####################
###############                  2021.1                     ####################
################################################################################
################################################################################
################################################################################

#### chamando base:

names(mtcars)

summary(mtcars)


##### Criando uma função

centralizacao <- function(x) {
  x <- x - mean(x)
}

y <- centralizacao(mtcars$cyl)

y


#### Função vetorizada 

apply(mtcars[ ,-11], 2, mean)

## aplicação a uma base de dados

par(mfrow = c(2, 2)) #formando quadrantes

mapply(hist, mtcars[ , 1:4], MoreArgs=list(main='Histograma', xlab = 'N', 
                                           ylab = 'Frequência')) #gráficos

